blog/cs/web.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-15 Fri 09:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Web Development</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Web Development</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Web Performance</a></li>
<li><a href="#orgheadline27">HTTP1.1 Cache Control</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Web Performance</h2>
<div class="outline-text-2" id="text-orgheadline1">
<dl class="org-dl">
<dt>Edge Cache</dt><dd>The cache on edge servers, controlled by CDN or proxy server.</dd>
<dt>Browser Cache</dt><dd>The cache on browser, controlled by browser.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27">HTTP1.1 Cache Control</h2>
<div class="outline-text-2" id="text-orgheadline27">
</div><ul class="org-ul"><li><a id="orgheadline19"></a>Expiration<br  /><ul class="org-ul"><li><a id="orgheadline8"></a>Request<br  /><ul class="org-ul"><li><a id="orgheadline2"></a>no-store<br  /></li>
<li><a id="orgheadline3"></a>max-age<br  /></li>
<li><a id="orgheadline4"></a>max-stale<br  /></li>
<li><a id="orgheadline5"></a>min-fresh<br  /></li>
<li><a id="orgheadline6"></a>no-transform<br  /></li>
<li><a id="orgheadline7"></a>only-if-cached<br  /></li></ul></li>
<li><a id="orgheadline18"></a>Response<br  /><ul class="org-ul"><li><a id="orgheadline9"></a>public<br  /></li>
<li><a id="orgheadline10"></a>private<br  /></li>
<li><a id="orgheadline11"></a>no-cache<br  /></li>
<li><a id="orgheadline12"></a>no-store<br  /></li>
<li><a id="orgheadline13"></a>no-transform<br  /></li>
<li><a id="orgheadline14"></a>must-revalidate<br  /></li>
<li><a id="orgheadline15"></a>proxy-revalidate<br  /></li>
<li><a id="orgheadline16"></a>max-age<br  /></li>
<li><a id="orgheadline17"></a>s-maxage<br  /></li></ul></li></ul></li>
<li><a id="orgheadline25"></a>Validation<br  /><ul class="org-ul"><li><a id="orgheadline23"></a><a href="https://en.wikipedia.org/wiki/HTTP_ETag">ETag</a><br  /><ul class="org-ul"><li><a id="orgheadline20"></a>ETag Value<br  /><div class="outline-text-6" id="text-orgheadline20">
<ol class="org-ol">
<li>is unique.</li>
<li>typically looks like as the following:</li>
</ol>
<p class="verse">
"123456789"    – A strong ETag validator<br  />
W/"123456789"  – A weak ETag validator<br  />
</p>
<ol class="org-ol">
<li>Common methods of ETag generation include using a collision-resistant hash function 
of the resource's content, a hash of the last modification timestamp, or even just a revision number.</li>
</ol>
</div></li>
<li><a id="orgheadline21"></a>Pros.<br  /><div class="outline-text-6" id="text-orgheadline21">
<ol class="org-ol">
<li>Don't rely on client's clock.</li>
</ol>
</div></li>
<li><a id="orgheadline22"></a>Cons.<br  /><div class="outline-text-6" id="text-orgheadline22">
<ol class="org-ol">
<li>ETag requests a client make at least a request, so it might not that useful</li>
</ol>
<p>
if the lantecy betwen a client to your server is high, which leads the pages loading still 
took too long.
</p>
</div></li></ul></li>
<li><a id="orgheadline24"></a>Last-Modified<br  /><div class="outline-text-5" id="text-orgheadline24">
<ol class="org-ol">
<li>does same thing as ETag does but it is timebased checking.</li>
<li>unit is seconds.</li>
<li>GMT.</li>
</ol>
</div></li></ul></li>
<li><a id="orgheadline26"></a>Conclution<br  /><div class="outline-text-4" id="text-orgheadline26">
<ol class="org-ol">
<li>For cache expiration, use <b>max-age</b> to reduce requests, use <b>private</b> when handling sesetive data.</li>
<li>use <b>ETag</b> or <b>Last-Modified</b> to valid content.</li>
</ol>
</div></li></ul>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Hsin-Yi</p>
<p class="date">Created: 2016-04-15 Fri 09:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
